In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('/users/lauragallo/Desktop/DATA/bookings.csv')

In [3]:
df

       city          ds  bookings
0    City_2  01/01/2013        69
1    City_2  01/02/2013       101
2    City_2  01/03/2013       134
3    City_2  01/04/2013       155
4    City_2  01/05/2013       104
..      ...         ...       ...
724  City_1    12/27/13        55
725  City_1    12/28/13        63
726  City_1    12/29/13        55
727  City_1    12/30/13        66
728  City_1    12/31/13        65

[729 rows x 3 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 729 entries, 0 to 728
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   city      729 non-null    object
 1   ds        729 non-null    object
 2   bookings  729 non-null    int64
dtypes: int64(1), object(2)
memory usage: 17.2+ KB

In [5]:
df['dates'] = pd.to_datetime(df['ds'],infer_datetime_format=True)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 729 entries, 0 to 728
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   city      729 non-null    object
 1   ds        729 non-null    object
 2   bookings  729 non-null    int64
 3   dates     729 non-null    datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 22.9+ KB

In [7]:
df

       city          ds  bookings      dates
0    City_2  01/01/2013        69 2013-01-01
1    City_2  01/02/2013       101 2013-01-02
2    City_2  01/03/2013       134 2013-01-03
3    City_2  01/04/2013       155 2013-01-04
4    City_2  01/05/2013       104 2013-01-05
..      ...         ...       ...        ...
724  City_1    12/27/13        55 2013-12-27
725  City_1    12/28/13        63 2013-12-28
726  City_1    12/29/13        55 2013-12-29
727  City_1    12/30/13        66 2013-12-30
728  City_1    12/31/13        65 2013-12-31

[729 rows x 4 columns]

### Create Dataframes for City_1 and City_2

In [8]:
city_1=df.loc[df['city'] == 'City_1']

In [9]:
city_2=df.loc[df['city'] == 'City_2']

### Rolling mean for City_1 and City_2

In [10]:
city_1.loc[:,'Rolling Average'] = city_1.loc[:,'bookings'].rolling(30).mean()

C:\Users\lauragallo\AppData\Local\Temp\ipykernel_1916\3370250492.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  city_1.loc[:,'Rolling Average'] = city_1.loc[:,'bookings'].rolling(30).mean()

In [11]:
city_2.loc[:,'Rolling Average'] = city_2.loc[:,'bookings'].rolling(30).mean()

C:\Users\lauragallo\AppData\Local\Temp\ipykernel_1916\2613399656.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  city_2.loc[:,'Rolling Average'] = city_2.loc[:,'bookings'].rolling(30).mean()

### Rolling standard deviation for City_1 and City_2

In [12]:
city_1['Rolling StDev']= city_1['bookings'].rolling(30).std()

C:\Users\lauragallo\AppData\Local\Temp\ipykernel_1916\3802983860.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  city_1['Rolling StDev']= city_1['bookings'].rolling(30).std()

In [13]:
city_2['Rolling StDev']= city_1['bookings'].rolling(30).std()

C:\Users\lauragallo\AppData\Local\Temp\ipykernel_1916\3119234664.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  city_2['Rolling StDev']= city_1['bookings'].rolling(30).std()

In [14]:
city_1

       city          ds  bookings      dates  Rolling Average  Rolling StDev
364  City_1  01/01/2013        16 2013-01-01              NaN            NaN
365  City_1  01/02/2013        20 2013-01-02              NaN            NaN
366  City_1  01/03/2013        15 2013-01-03              NaN            NaN
367  City_1  01/04/2013        22 2013-01-04              NaN            NaN
368  City_1  01/05/2013        16 2013-01-05              NaN            NaN
..      ...         ...       ...        ...              ...            ...
724  City_1    12/27/13        55 2013-12-27        63.100000      12.949105
725  City_1    12/28/13        63 2013-12-28        63.166667      12.943067
726  City_1    12/29/13        55 2013-12-29        62.733333      12.993190
727  City_1    12/30/13        66 2013-12-30        63.533333      12.397812
728  City_1    12/31/13        65 2013-12-31        63.133333      12.139231

[365 rows x 6 columns]

In [15]:
city_2

       city          ds  bookings      dates  Rolling Average  Rolling StDev
0    City_2  01/01/2013        69 2013-01-01              NaN            NaN
1    City_2  01/02/2013       101 2013-01-02              NaN            NaN
2    City_2  01/03/2013       134 2013-01-03              NaN            NaN
3    City_2  01/04/2013       155 2013-01-04              NaN            NaN
4    City_2  01/05/2013       104 2013-01-05              NaN            NaN
..      ...         ...       ...        ...              ...            ...
359  City_2    12/27/13       232 2013-12-27       197.500000            NaN
360  City_2    12/28/13       182 2013-12-28       198.500000            NaN
361  City_2    12/29/13       199 2013-12-29       199.966667            NaN
362  City_2    12/30/13       209 2013-12-30       201.900000            NaN
363  City_2    12/31/13       221 2013-12-31       203.533333            NaN

[364 rows x 6 columns]

### dropna() with inplace = True - drops all missing rows with missing values

In [16]:
city_1.dropna(inplace=True)

C:\Users\lauragallo\AppData\Local\Temp\ipykernel_1916\1894879805.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  city_1.dropna(inplace=True)

In [17]:
city_2.dropna(inplace=True)

C:\Users\lauragallo\AppData\Local\Temp\ipykernel_1916\3064932368.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  city_2.dropna(inplace=True)

### Calculating Standard deviation for high

In [22]:
city_1['TwosdAbove'] = city_1['Rolling Average'] + (2*city_1['Rolling StDev'])

C:\Users\lauragallo\AppData\Local\Temp\ipykernel_1916\2736207748.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  city_1['TwosdAbove'] = city_1['Rolling Average'] + (2*city_1['Rolling StDev'])